app/controllers/conversations_controller.rb

  def index
  	@logs = Log.where("id >= ?",@@limit)
---
SELECT "logs".* FROM "logs" WHERE "logs"."id" = ? LIMIT 1  [["id", 10]]

  def destroy
    @@limit = Log.find(:last, :select => "id")
---
SELECT id FROM "logs" WHERE "logs"."id" = ? LIMIT 1  [["id", :id]]

  def create
  	@log = Log.new
  	@log.talk = params[:log][:talk]
  	@@input = params[:log][:talk]

  	@log.username = "tera" #params[:log][:username]
  	@log.time = Time.now
  	@log.save
---
INSERT INTO "logs" ("created_at", "talk", "time", "updated_at", "username") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 21 Sep 2015 11:17:35 UTC +00:00], ["talk", "feafe"], ["time", 2015-09-21 20:17:35 +0900], ["updated_at", Mon, 21 Sep 2015 11:17:35 UTC +00:00], ["username", "tera"]]

  def reply
	#人工無脳の返信を書く
    @log = Log.new
  	@log.talk = chatbot(@@input)

  	@log.username = "akari" #params[:log][:username]
  	@log.time = Time.now
  	@log.save
---
INSERT INTO "logs" ("created_at", "talk", "time", "updated_at", "username") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 21 Sep 2015 14:15:50 UTC +00:00], ["talk", "I am akari"], ["time", 2015-09-21 23:15:50 +0900], ["updated_at", Mon, 21 Sep 2015 14:15:50 UTC +00:00], ["username", "akari"]]